; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v13 ?v3)
             (pred_5 ?v5 ?v4)
             (pred_7 ?v13 ?v4)
             (pred_4 ?v6 ?v13 )
	     (pred_9 ?v13)
             (pred_3 ?v9)
             (pred_11 ?v5)
             (pred_2 ?v4)
             (pred_8 ?v13)
             (pred_12 ?v5)
             (pred_6 ?v13)
             (pred_1 ))



(:action op_4
:parameters (?v12 ?v8 ?v1 ?v7)
:precondition (and (pred_3 ?v12) (pred_3 ?v8) (pred_11 ?v1) (pred_2 ?v7)
          (pred_10 ?v12 ?v8) (pred_5 ?v1 ?v7)
                   (pred_7 ?v8 ?v7) (pred_9 ?v12) 
                   (pred_8 ?v8) (pred_12 ?v1))
:effect (and  (pred_6 ?v8) (not (pred_8 ?v8))))


(:action op_3
:parameters (?v12 ?v11)
:precondition (and (pred_3 ?v12) (pred_3 ?v11)
               (pred_9 ?v12) (pred_10 ?v12 ?v11) (pred_6 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v12))))

(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_3 ?v12) (pred_11 ?v1) 
                  (pred_9 ?v12) (pred_4 ?v1 ?v12) (pred_1 ))
:effect (and (pred_12 ?v1)
   (not (pred_4 ?v1 ?v12)) (not (pred_1 ))))


(:action op_2
:parameters (?v12 ?v2 ?v10)
:precondition (and (pred_3 ?v12) (pred_11 ?v2) (pred_11 ?v10)
                  (pred_9 ?v12) (pred_12 ?v10) (pred_4 ?v2 ?v12))
:effect (and (pred_12 ?v2) (pred_4 ?v10 ?v12)
        (not (pred_12 ?v10)) (not (pred_4 ?v2 ?v12))))

(:action op_1
:parameters (?v12 ?v1)
:precondition (and (pred_3 ?v12) (pred_11 ?v1) 
                  (pred_9 ?v12) (pred_12 ?v1))
:effect (and (pred_1 ) (pred_4 ?v1 ?v12) (not (pred_12 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_18 obj_08 obj_12 obj_17 obj_07 obj_16 obj_20 obj_15 obj_06 obj_01 obj_03 obj_13 obj_19 obj_04 obj_10 obj_09
    obj_14 obj_05
    obj_11 obj_02
    )

    (:init
       (pred_1)

       (pred_3 obj_18)
       (pred_3 obj_08)
       (pred_3 obj_12)
       (pred_3 obj_17)
       (pred_3 obj_07)
       (pred_3 obj_16)
       (pred_3 obj_20)
       (pred_3 obj_15)
       (pred_3 obj_06)
       (pred_3 obj_01)
       (pred_3 obj_03)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_09)
       (pred_2 obj_14)
       (pred_2 obj_05)
       (pred_11 obj_11)
       (pred_11 obj_02)

       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_07 obj_16)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_16 obj_01)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_16 obj_07)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_01)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_01 obj_16)
       (pred_10 obj_01 obj_06)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_19 obj_04)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_19)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_10)
       (pred_8 obj_17)
       (pred_8 obj_03)
       (pred_7  obj_17 obj_14)
       (pred_7  obj_03 obj_05)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_6 obj_12)
       (pred_6 obj_07)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_15)
       (pred_6 obj_06)
       (pred_6 obj_01)
       (pred_6 obj_13)
       (pred_6 obj_19)
       (pred_6 obj_04)
       (pred_6 obj_10)
       (pred_6 obj_09)

       (pred_5  obj_11 obj_14)
       (pred_5  obj_02 obj_05)
       (pred_4 obj_11 obj_20)
       (pred_4 obj_02 obj_17)
       (pred_9 obj_04)
    )

    (:goal (and
       (pred_4 obj_11 obj_12)
    ))
(:constraints
  (always (not (pred_9 obj_01)))
)
)

; plan
1. (op_3 obj_04 obj_10)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_10)
   goals met: 0 of 1
2. (op_3 obj_10 obj_09)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_09)
   goals met: 0 of 1
3. (op_3 obj_09 obj_13)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_13)
   goals met: 0 of 1
4. (op_3 obj_13 obj_15)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_15)
   goals met: 0 of 1
5. (op_3 obj_15 obj_20)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_20)
   goals met: 0 of 1
6. (op_5 obj_20 obj_11)
   deleted: (pred_4 obj_11 obj_20) (pred_1)
   added: (pred_12 obj_11)
   goals met: 0 of 1
7. (op_3 obj_20 obj_12)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_12)
   goals met: 0 of 1
8. (op_1 obj_12 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_1) (pred_4 obj_11 obj_12)
   goals met: 1 of 1
